# Exercise: Top 10 movies

Dataset: https://github.com/abulbasar/data/tree/master/movielens

1. Load movies.csv as movies dataframe and ratings.csv as ratings dataframe
2. How many records are there in movies and ratings dataframe
3. Find the movies, for which title contains Godfather? [Hint: use movies.title.str.contains() to find
substring in title]
4. How many ratings the movie "Godfather, The (1972)" has received?[Answer: 200]
5. Using ratings dataframe, calculate average rating and number of ratings for each movie. What is the
average rating for "Godfather, The (1972)" [Answer: 4.487]
6. Remove all movie Id that have received fewer than 100 ratings. How many such movies are there?
[Answer: 149]
7. Sort the data by avg rating and take top 10 records.
8. Merge the output with movies dataframe to show title. [Hint: call pd.merge function]

In [1]:
import pandas as pd

```
df = pd.read_csv("c:\\rdata")
df = pd.read_csv("c:/rdata")
df = pd.read_csv(r"c:\rdata")
```

In [2]:
movies = pd.read_csv("/data/movielens/movies.csv")

In [3]:
movies.shape

(9125, 3)

In [4]:
movies.head()

,movieId,title,genres
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
1,2,Jumanji (1995),Adventure|Children|Fantasy
2,3,Grumpier Old Men (1995),Comedy|Romance
3,4,Waiting to Exhale (1995),Comedy|Drama|Romance
4,5,Father of the Bride Part II (1995),Comedy

In [5]:
ratings = pd.read_csv("/data/movielens/ratings.csv")
ratings.head()

   userId  movieId  rating   timestamp
0       1       31     2.5  1260759144
1       1     1029     3.0  1260759179
2       1     1061     3.0  1260759182
3       1     1129     2.0  1260759185
4       1     1172     4.0  1260759205

In [6]:
ratings.shape

(100004, 4)

In [7]:
movies[movies.title.str.contains("Godfather")]

      movieId                            title                        genres
695       858            Godfather, The (1972)                   Crime|Drama
977      1221   Godfather: Part II, The (1974)                   Crime|Drama
1585     2023  Godfather: Part III, The (1990)  Crime|Drama|Mystery|Thriller
5470     8607          Tokyo Godfathers (2003)     Adventure|Animation|Drama

In [10]:
god_father = movies[movies.title == "Godfather, The (1972)"]
god_father

     movieId                  title       genres
695      858  Godfather, The (1972)  Crime|Drama

In [13]:
god_father_id = int(god_father.movieId)
god_father_id

858

In [14]:
ratings[ratings.movieId == god_father_id].shape

(200, 4)

In [20]:
avg_rating_by_movie_id = ratings.groupby("movieId").rating.agg(["mean", "count"])
avg_rating_by_movie_id.sample(10)

             mean  count
movieId
2403     3.472222     18
74530    3.500000      3
48518    3.000000      2
6582     3.166667      3
95963    3.500000      1
2998     4.000000      1
48231    3.500000      1
7122     3.750000      2
4167     2.437500      8
4255     1.714286      7

In [17]:
avg_rating_by_movie_id.iloc[858,:]

mean      4.22619
count    42.00000
Name: 1060, dtype: float64

In [18]:
avg_rating_by_movie_id.loc[858,:]

mean       4.4875
count    200.0000
Name: 858, dtype: float64

In [21]:
avg_rating_by_movie_id.reset_index().sample(10)

      movieId      mean  count
2969     3716  3.500000      2
7500    77435  5.000000      1
8072    95752  4.500000      1
6458    46972  3.055556     18
2553     3176  3.500000     66
5369     8273  4.000000      1
801       992  2.500000      2
359       408  3.000000      1
2162     2702  2.880952     21
6693    53326  2.000000      1

In [22]:
avg_rating_by_movie_id.reset_index().query("movieId == 858")

     movieId    mean  count
695      858  4.4875    200

In [30]:
avg_rating_by_movie_id_gt_100 = avg_rating_by_movie_id[avg_rating_by_movie_id["count"] > 100]
avg_rating_by_movie_id_gt_100.sample(10)

             mean  count
movieId
3147     3.922330    103
592      3.397959    196
595      3.750000    176
434      3.084906    106
36       3.937500    104
1270     4.015487    226
527      4.303279    244
1617     4.120000    125
2918     4.007519    133
2762     4.018135    193

In [35]:
top_10 = avg_rating_by_movie_id_gt_100.sort_values("mean", ascending = False).iloc[:10, :]
top_10

             mean  count
movieId
858      4.487500    200
318      4.487138    311
1221     4.385185    135
50       4.370647    201
527      4.303279    244
1193     4.256944    144
608      4.256696    224
296      4.256173    324
2858     4.236364    220
58559    4.235537    121

In [36]:
top_10.merge(movies, on = "movieId")

,movieId,mean,count,title,genres
0,858,4.487500,200,"Godfather, The (1972)",Crime|Drama
1,318,4.487138,311,"Shawshank Redemption, The (1994)",Crime|Drama
2,1221,4.385185,135,"Godfather: Part II, The (1974)",Crime|Drama
3,50,4.370647,201,"Usual Suspects, The (1995)",Crime|Mystery|Thriller
4,527,4.303279,244,Schindler's List (1993),Drama|War
5,1193,4.256944,144,One Flew Over the Cuckoo's Nest (1975),Drama
6,608,4.256696,224,Fargo (1996),Comedy|Crime|Drama|Thriller
7,296,4.256173,324,Pulp Fiction (1994),Comedy|Crime|Drama|Thriller
8,2858,4.236364,220,American Beauty (1999),Drama|Romance
9,58559,4.235537,121,"Dark Knight, The (2008)",Action|Crime|Drama|IMAX